[{
  "_id": {
    "$oid": "5dfe6a54df7fec7d173803ce"
  },
  "id": 0,
  "title": "Hello World! This Is Paxterya Under Construction!",
  "author": "ExxPlore",
  "body": "<p>Welcome on the brand new website of Paxterya, a soon-to-be Vanilla Minecraft server! Minecraft has been revived lately and we don't want to miss out on that. We, that is TxT and ExxPlore, are the admins of Paxterya. A while ago, we already hosted a Minecraft survival server which was tons of fun. But this time it's going to be even better! We present to you the basic concept of Paxterya:</p>\n\n      <h3>Vanilla Survival</h3>\n      <p>On Paxterya, you get the full Vanilla Minecraft experience. You start from scratch like in Singleplayer, but with the advantage of a welcoming community around you!</p>\n\n      <div class=\"article-img\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/article1.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/article1.jpg\">\n</picture>\n<span class=\"subtitle\">The Spawn Hub on Paxterya</span>\n      </div>\n\n      <h3>Build a Town</h3>\n      <p>Our goal is to build a medieval themed town around the spawn of the map. If you are not a fan of this building style or if you would rather live on your own, then you can also explore the world and set your own base up.</p>\n\n      <h3>Be Independent</h3>\n      <p>If you don't choose to build in the spawn area, you can go rural and build in whatever style you like outside of our town! Our world has no limits besides the sky! You could even create your own cities and communities or build huge farms.\n\n        <h3>Vanilla-ish Survival?</h3>\n        <p>Well, when we say Vanilla we mean that your experience is just like in Vanilla singleplayer, with some modifications to make playing together smoother. This includes a plugin with which only half the players need to sleep, <a href=\"https://play.paxterya.com/dynmap\">Dynmap</a>, so you can view Paxterya's map wherever you go, and last but not least a plugin that helps us figuring out who burned your home down. If so.</p>\n\n        <h3>Sounds good?</h3>\n        <p>Did this quick overview make you feel like joining? Paxterya is going to launch on <b>December 1st, 2019</b>, but you can already <b><a href=\"https://discord.gg/mAjZCTG\">join our Discord server</a></b> and <b><a href=\"join-us.html\">apply</a></b>! See you soon!</p>\n     ",
  "date": {
    "$date": "2019-11-19T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5dfe6a87df7fec7d173803d1"
  },
  "id": 1,
  "title": "Paxterya Beta 2 Now Up and Running!",
  "author": "ExxPlore",
  "body": "<p>Today was the (semi)big day! We've made another milestone towards Paxterya's big launch: Paxterya Beta 2 was opened!<br>\n        If all those Paxteryas and launches got you confused, here's a quick overview:</p>\n\n      <h3>June 3rd, 2017</h3>\n      <p>An SMP launched. Historians refer to it as \"The Original Paxterya\". After its downfall, there was a long period of nothingness. Until it was agreed upon to revive this glorious name.</p>\n\n      <h3>September 23rd, 2019</h3>\n      <p>Paxterya Beta launched. Just an ordinary SMP where members needed to apply in a Discord channel. Oldschool! Died out after a few months, the players not knowing what to build next. Classic Minecraft problem we try to approach with Paxterya's ongoing development!</p>\n\n      <h3>December 1st, 2019</h3>\n      <p>Paxterya Beta 2 launched. New world, new motivation, new ideas, and also: new website! The applications are no longer done in public forums, but via our application form! Your chance to <a href=\"https://paxterya.com/join-us\">join the community</a> and lay the foundation for the future!</p>\n\n      <h3>What's next?</h3>\n      <p>At some point in the future, Paxterya will be sophisticated enough for us to remove the Beta from its name. Until then, let's build another unique world in our favorite game of all!</p>\n    ",
  "date": {
    "$date": "2019-12-01T18:55:03.856Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5dfe6aaadf7fec7d173803d4"
  },
  "id": 2,
  "title": "Paxterya Recap #1: A Beautiful Start",
  "author": "ExxPlore",
  "body": "<p>Paxterya Beta 2 has been online for one week now and lots of cool things happened. In the Paxterya Recap series, we want to regularly give you some insight into what is happening on the server. So let's get into it!</p>\n\n      <div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/article2.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/article2.jpg\">\n</picture>\n        <span class=\"subtitle\">The center of the Town of Paxterya</span>\n      </div>\n\n      <p>After the slight surprise at the beginning that the spawn is in a snow biome, the first few settlers started to like the idea of a cozy wooden hut in a wintry environment, now that Christmas is nearing. So they founded a town in the midst of the crisp-cold area.</p>\n\n      <div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/article3.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/article3.jpg\">\n</picture>\n        <span class=\"subtitle\">The Town center from South</span>\n      </div>\n\n      <h3>The Town of Paxterya</h3>\n      <p>The first town, at the center of the world, is currently run by its mayor TxT. He promised elections though, so if you want to have a say, become a town citizen by simply building a (medieval-themed) house there! We're happy to see that a handful of people already moved to our prospering town and contributed neat houses! If you're not yet living in the Town of Paxterya, we suggest you do it soon as long as there are good spots left!</p>\n\n      <h3>Your own Town</h3>\n      <p>In case you don't like the medieval theme, why not found your very own town with its own theme? As soon as you have three houses from three different people in an area, the Town of Paxterya will recognize your status and be looking forward to building a diplomatic relation!</p>\n      ",
  "date": {
    "$date": "2019-12-07T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5dfe6accdf7fec7d173803d6"
  },
  "id": 3,
  "title": "Paxterya Recap #2: Feeling At Home In 1.15",
  "author": "ExxPlore",
  "body": "<p>Another week has passed in the lands of Paxterya and lots of cool new things are to be discovered! Not only have we updated to <b>Minecraft version 1.15</b>, but many beautiful buildings have been added to the world as well!</p>\n\n      <h3>The Town of Paxterya: A new Mayor!</h3>\n\n<div class='article-img'><img src='https://stor.paxterya.com/website/articles/article4.webp'><span class=\"subtitle\">The paxteryan Town Hall</span></div>\n\n      <p>The people had a choice: The old mayor TxT held its promise by organising a mayor election. TxT himself however did not candidate. But jadesheep and Veikmaster did! And the winner was… both of them! The candidates not being very competitive and the citizens approving, it just so happened that the Town of Paxterya now has a government of two people! We're looking forward to seeing the town prosper under our new leaders.<br>\nTheir task will be to organize the town: new citizen must be registered, people ought to pay taxes to finance public infrastructure, and finally the aesthetics of the town must be managed, too. Lots of important tasks we shall be grateful for for being in competent hands! </p>\n\n      <h3>The first member-founded town: Penliam</h3>\n      <p>Not only have there been major developments in the Town of Paxterya, as there now is another town in our world! Penliam, with its mayor ChryoFyre, is located a kilometer south-west of the Town of Paxterya and thus outside the snowy tundra. As every town gets an area on the map that they exclusively control, Penliam can easily be found on our Dynmap, too. It seems to be medieval-themed as well and it's definitely worth a visit! The Town of Paxterya wishes Penliam good progress and hopes to build trustful trade relations one day!</p>\n\n      <h3>The demise of the Ender Dragon</h3>\n      <p>In a swift and effective order-to-kill mission which lasted no longer than 10 minutes, an ensemble of blood-thirsty warriors took on the fight with the Ender Dragon. The latter stood no chance and was crushed before he even fully realized what was going on.<br>\nThe End is now conquered, but our journey has only just begun!</p>\n      ",
  "date": {
    "$date": "2019-12-19T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e09e0741d1e6b0dde82993d"
  },
  "id": 6,
  "title": "Paxterya Recap #3: Ready for 2020! ",
  "author": "ExxPlore",
  "body": "<p>Christmas is over, the gifts under the Christmas tree in the Town of Paxterya have been collected, and hopefully everyone recharged power for the upcoming year! </p>\n\n      <h3>Infrastructure innovated</h3>\n      <div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/002.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/002.jpg\">\n</picture>\n        <span class=\"subtitle\">The central Nether hub</span>\n      </div>\n      <p>Despite the holidays, many Paxteryans still found time for playing some Minecraft, and some infrastructural milestones have been achieved!<br>\nThe Nether hub, while far from finished, has majorly improved in both looks and logistics. There's now a post office with one chest for each Paxteryan where you can leave somebody a package before rapidly getting to the upper level of the hub via the new minecart elevator. But most importantly, it's safe!<br>\nAnd in the next year, much more infrastructure is to be expected; the Town government has already planned a harbor as well as a train station and rails to the other town, Penliam! If you want to take part in these or other projects, just message our mayors Veikmaster and jadesheep!</p>\n\n      <h3>Communal consumerism</h3>\n<div class=\"article-img\">\n        <img src=\"https://stor.paxterya.com/website/articles/001.jpg\">\n        <span class=\"subtitle\">The communal gold farm</span>\n      </div>\n      <p>Three Paxteryans, Dexter, Escanor and ChryoFyre, have been busy like bees and provided awesome farms to the whole of Paxterya! In the Nether, you can get tons of gold from pigmen and in the End, you can get endless XP from Endermen! Pun intended.<br>\nAnd for all the other things you might need and can't get from those farms, check out one of the many shops that have been built in the Town of Paxterya! A good overview over all the shops can be found in our #marketplace Discord channel.</p>\n\n      <h3>2020, the year of Paxterya </h3>\n      <p>We wish you all a good start in the new year and warmly invite you to take part in the shaping of Paxterya if you're not already a member. We can't wait to see Paxterya evolve in 2020! See you next year!</p>",
  "date": {
    "$date": "2019-12-29T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e1b2ec304a7655464ca410b"
  },
  "id": 8,
  "title": "Paxterya Recap #4: New Year's Resolutions! ",
  "author": "ExxPlore",
  "body": "<p>The new year has just begun (well, two weeks ago) and it will bring big changes to Paxterya! Without being a fortune teller, I think it's safe to say that at some point in 2020, there'll be a newer and bigger Paxterya! But for now, we're far from finished on our current map.</p>\n\n      <div class=\"article-img\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/005.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/005.jpg\">\n</picture>\n        <span class=\"subtitle\">The beginnings of Cookie Town</span>\n      </div>\n\n<h3>Projects, projects, projects</h3>\n<p>To prove this point, have a look at our <a href=\"https://trello.com/b/5rMBYiC5/town-of-paxterya\" target=\"_blank\">project list on Trello</a>! It is continuously updated, so we'll be happy to include your build ideas! And keep in mind that this is only the project list of the Town of Paxterya, so who knows what other towns might be planning? </p>\n\n\n\n      <h3>Cookie Town</h3>\n      <p>Speaking of towns: There's a new one! Thanks to the delicious Cookie Town with its mayor MrSprouse, there are now three beautiful towns in the lands of Paxterya for new members to choose from! If you're new and want to join a town, just message the Town's mayor!</p>\n\n<div class=\"article-img\">\n        <img src=\"https://stor.paxterya.com/website/articles/004.jpg\">\n        <span class=\"subtitle\">The Underground</span>\n  </div>\n\n      <h3>Underground activities</h3>\n\n      <p>What meets the eye is not all there is. This principle also applies to the Town of Paxterya, where you now can discover buildings in the Underground, too. Its location is highly classified (it's under TxT's house), so nobody really knows where it is, but if you knew where it was, it would definitely be worth a visit! At the time writing this, there's even a free plot left, so if you're a prepper, you should lose no time buying a plot in the safety of the Underground!</p>\n\n      <h3>A looong bridge</h3>\n<div class=\"article-img\">\n        <img src=\"https://stor.paxterya.com/website/articles/003.jpg\">\n        <span class=\"subtitle\">The longest bridge yet</span>\n      </div>\n      <p>We started 2020 off with connecting humans. Isn't that beautiful? Many busy bees from the Town of Paxterya and Penliam helped out build a stunning railway bridge of nearly one kilometer in just a couple days! The result looks nice and will look awesome once Optifine 1.15 is out and we can look at it with shaders!<br>\nAs a side note, another key infrastructure component has been added to the Town of Paxterya: A harbor, right next to the railway bridge! Our town is now officially ready for international guests and big business.</p>",
  "date": {
    "$date": "2020-01-11T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e30752c98785d4a2b9108c7"
  },
  "id": 9,
  "title": "Paxterya Recap #5: Serious Roleplay!",
  "author": "ExxPlore",
  "body": "<h3>The Government of Paxterya</h3>\n<p>TxT has come up with the idea of creating a new, intercommunal, institution; the Government of Paxterya! Now this is more like the United Nations than a national government, as it consists of the admins and all mayors of the paxteryan towns; Veikmaster and jadesheep from the Town of Paxterya, ChryoFyre from Penliam, MrSprouse from Cookie Town and swabfu from the newly founded Paxterdam! The purpose of this committee is to better connect the different towns: reliable infrastructure, trade and diplomatic relations! For the latter, an embassy will be built in each town, as well as a headquarters of the Government of Paxterya on neutral grounds! </p>\n\n<div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/006.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/006.jpg\">\n</picture>\n        <span class=\"subtitle\">The enormous Iron Factory</span>\n  </div>\n      <h3>The Industrial District</h3>\n      <p>There's a new player in town. In the Town of Paxterya that is. The Industrial District is now a very substantial part of the town, not only due to its size, but also due to its economic importance! The Iron Factory, built by Escanor and decorated by many Paxteryans, produces unimaginable amounts of iron, available for free for all citizens of the Town of Paxterya! Paxteryans gave the enormous building, presumably the biggest one yet on the server, the lovely nickname \"The Box\". And then there is the Quarry, dug out by TxT, which is where all of your stone needs are now met! At the very bottom of it, there are prepared mineshafts for productive mining sessions!</p>\n\n\n      <div class=\"article-img\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/007.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/007.jpg\">\n</picture>\n        <span class=\"subtitle\">Paxterya on YouTube!</span>\n      </div>\n      <h3>Paxterya broadcasts itself!</h3>\n\n      <p>Soon, Paxterya will be represented on another website you might have heard of! We're going to revive the old Paxterya YouTube channel which we used back in 2017, this time with more entertaining videos however! We're planning to do a Cinematic Competition between TxT and myself (ExxPlore), more details on that will be announced in a separate blog post! For now, feel free to head over to <a href=\"https://www.youtube.com/channel/UCH-JgwSf8J8tdjemXqihEKw\" target=\"_blank\"><b>our freshly designed YouTube channel</b></a>. We've got some fun ideas in mind and can't wait to show them to you!</p>\n",
  "date": {
    "$date": "2020-01-27T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e3574b8f0b91c24d5db049e"
  },
  "id": 10,
  "title": "Paxterya Recap #6: The Paxteryan Renaissance",
  "author": "ExxPlore",
  "body": "<p>Although the current season of Paxterya has been running for over two months now, it has experienced a new wave of motivation recently.</p>\n\n      <h3>May I introduce to you: The Veterans </h3>\n      <p>That motivation comes from a number of veterans (and non-veterans too) who (re)joined Paxterya. Veterans are those who were a member of the Ancient Paxterya back in 2017 and now rejoined our community. We're very happy to have the following veterans back on board: TheTelescreen, Setherz, Jmoose, Obisann, Blaubeerbaer and StarvingWolf!</p>\n\n<h3>Paxterya on 1.15.2</h3>\n<p>We've recently updated to version 1.15.2, but the thing everyone is actually waiting for is the release of the new Optifine version. We all can't wait to have Optifine, and especially shaders that will make our world look much more awesome, back! After two months of Optifine abstinence, we've learnt our lesson and from now on, we'll only update to newer Minecraft versions once Optifine is released. Let's face it: beautiful shaders and more FPS are more important than lava-floating Netherite items.</p>\n\n<div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/008.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/008.jpg\">\n</picture>\n        <span class=\"subtitle\">The small box next to the big box</span>\n  </div>\n\n<h3>3, 2, 1... Launch!</h3>\n<p>The Industrial District has a new box right next to the old box! The new box is a bit smaller than the old box, but a box is a box, right? It produces both gunpowder and sugarcane and thus our Elytra's fuel! For better orientation, we also added some pixel art to the buildings so that it's clear what's produced where. Sweet times being a citizen of the Town of Paxterya and being able to use these farms for free!</p>\n\n<h3>The YouTube Biz</h3>\n<p>Remember the YouTube channel we announced in the last Paxterya Recap? It is now active and there are already five videos. On the channel, we've already finished the forgotten tower in the Town of Paxterya, we've built an Infinity Room, we played Build Battle, and what's especially entertaining is the Hide and Seek video with a dozen of Paxteryans; <a href=\"https://www.youtube.com/watch?v=LJ73q9FAIQA\" target=\"_blank\">check it out</a>! We're looking forward to making more funny videos with the community in the future!</p>\n",
  "date": {
    "$date": "2020-02-16T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e4561c5e77d7045e19cdf39"
  },
  "id": 11,
  "title": "Cinematic Competition - Let's showcase Paxterya!",
  "author": "ExxPlore",
  "body": "<p>Paxterya needs advertising. And what better way of advertising is there than a compelling server trailer? Or even better: two of them! TxT and I (ExxPlore) will compete by each making the best cinematic we can to showcase all the amazing buildings on the server! There are no guidelines whatsoever, so everything's up to the contestants' creativity!</p>\n<p>\nWhen both projects are finished, it will be up to the Paxteryans which cinematic they like better. There will be a vote, and the winner's cinematic will be the official channel trailer of Paxterya and be showcased on the website! The competition starts today and the deadline is <b>April 19th, 8 PM CET!</b></p><p>\nI'm excited to start editing and curious to see what TxT comes up with. May the best cinematic win! </p>\n",
  "date": {
    "$date": "2020-04-05T00:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e5269e3b429080da9e52248"
  },
  "id": 12,
  "title": "Underground Building Competition",
  "author": "ExxPlore",
  "body": "<p>As many of you know, TxT has quite the passion for caves in this season of Paxterya. In a first step, he dug out a big cave under the Town of Paxterya and filled it with houses, in a second step he dug out an even bigger cave. All that's left to do is filling it with beautiful buildings, which we will do in the context of our first building contest. Here's how it will go:</p>\n\n<div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/009.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/009.jpg\">\n</picture>\n        <span class=\"subtitle\">Let's fill this mysterious cave!</span>\n  </div>\n\n<ul class=\"rules\">\n<li>There are 7 plots in the Underground, each 11x13 blocks big. They are outlined with dirt. To reserve one of those plots and participate in the contest, message an admin on Discord and then head to the Underground in-game to put your name on an available plot.</li>\n<li>As there is a prize pool for the winners, each participant is asked to contribute 2 diamonds (or more). If they can't afford it because they're new, they might find a donor on Discord! Also, all members who don't participate are welcome to donate diamonds to the prize pool as well. The diamonds can be delivered to the Town Hall, there's a chest you can't miss!</li>\n<li>Between the different plots, big dirt walls have been put in place so that the contestants can't see other people's buildings before the voting phase. If they want to keep up the surprise, that is.</li>\n<li>The building phase of the contest starts on <b>Monday, 24th of February 2020 at 12 AM GMT+1</b> and ends on <b>Monday, 2nd of March 2020 at 4 PM GMT+1</b>. After the end of the building phase, screenshots will be taken of every contest building, so that all members can vote on them. Of course you'll can look at the buildings in-game, too.</li>\n<li>The voting phase starts after the end of the building phase and ends three days later, on Thursday, 5th of March 2020 at 4 PM GMT+1. All Paxteryans will be asked to rate each building with 1-5 stars.</li>\n<li>Then, the winners will be declared on Discord and in a blog post! 1st place get's 80% of the prize pool, 2nd and 3rd place get 10% each! Also, the top 3 will get to choose a player head of their choice, be it of a Paxteryan or a decorative one!</li>\n</ul>\n\n<h3>TL;DR</h3>\n<ul class=\"rules\">\n<li>Message an admin to participate, reserve your plot in-game</li>\n<li>Pay 2+ diamonds in the Town Hall (Building Contest chest)</li>\n<li>Finish your building until March 2, 4 PM GMT+1</li>\n<li>Rate the buildings with 1-5 stars until March 5, 4 PM GMT+1</li>\n</ul>\n\n<p>Enough explanations, now let's get building and may the best builders win!</p>",
  "date": {
    "$date": "2020-02-22T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e616125beb3d905cebb3222"
  },
  "id": 13,
  "title": "Underground Building Competition: The Winners",
  "author": "ExxPlore",
  "body": "<p>The Underground Building Contest has ended today! 14 members have rated 7 contestants' buildings, and today we did the math and can now announce:</p>\n\n<h3>The winner is: MushrooMax420</h3>\n<p>Congratulations to MushrooMax420 aka Escanor____ for winning breathtaking <b>104 diamonds!</b> His cozy medieval house has convinced the electorate and he can now call himself the winner of the first ever building contest on Paxterya!</p>\n\n<div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/010.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/010.jpg\">\n</picture>\n        <span class=\"subtitle\">The winning house</span>\n  </div>\n<p>Here's the rank list with each contestant's average stars out of five!</p>\n<br>\n<ul>\n<li>1. MushrooMax420: 3.8718</li>\n<li>2. Veikmaster: 3.8077</li>\n<li>3. ExxPlore: 3.7308</li>\n<li>4. TxT: 3.7051</li>\n<li>5. SadQrwaRak (DQ): 3.5606</li>\n<li>6. triXtr: 3.4405</li>\n<li>7. kingofkittens123: 1.9286</li>\n</ul>\n<br>\n<p>We'd like to thank all contestants for their beautiful buildings, and all donors and voters who made this contest work! To check out all the participants' buildings, head on over to the Underground in the Town of Paxterya!</p>",
  "date": {
    "$date": "2020-03-04T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e6f57447490703b6a127d0f"
  },
  "id": 14,
  "title": "Paxterya Recap #7: Progress Report",
  "author": "ExxPlore",
  "body": "<p>It's been a while since the last Paxterya Recap and even apart from the Underground Building Contest we posted about, lots and lots has happened on the server!</p>\n\n<div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/011.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/011.jpg\">\n</picture>\n        <span class=\"subtitle\">The Colosseum in the Town of Paxterya</span>\n  </div>\n\n<div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/012.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/012.jpg\">\n</picture>\n        <span class=\"subtitle\">The glass dome in Cookieville</span>\n  </div>\n\n      <h3>New features on the website</h3>\n      <p>Let's start with the changes on our website: under \"Our World\", there's now a page for each town to be showcased! Their main purpose is to give new Paxteryans an impression of all towns without having to travel thousands of blocks. This will facilitate their decision if and which town they want to join! <br>\nThen there's another feature that only whitelisted members have access to: all Paxteryans can now log into the member section (footer > login) and use the new bulletin board to organize trading! </p>\n\n<h3>Railway revamped</h3>\n<p>Remember the railway bridge from one of the first blog posts? Well, the Paxteryan Railway has grown big time, now connecting three towns: The Town of Paxterya, Penliam and Cookieville! It's not the fastest way of transport, it taking 6 minutes to get from the capital to Cookieville, but a very relaxing one.</p>\n\n\n<h3>2 new boxes in the Industrial District</h3>\n<p>Another large-scale project has expanded big time as well: The Industrial District now counts four boxes! The Iron Factory, Rocket Factory, Tree Farm and Supersmelter! Now it really is a district. This also means we now can get tons of resources to build huge monuments!</p>\n\n\n\n<h3>Massive builds</h3>\n<p>Speaking of huge monuments: two of them have been finished! The glass dome in Cookieville and the Colosseum in the Town of Paxterya now reached their full beauty!<br>\nAnd then there's been lots of smaller additions to the Town of Paxterya: the steampunk house, the wheat field, the barn, the graveyard and the Regal District and the Pleb District! At this point, more amazing things have been built than we can showcase in a single blog post; you'll have to check it out for yourself! </p>\n",
  "date": {
    "$date": "2020-03-15T23:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e9c2273d752836f16d9f1b9"
  },
  "id": 15,
  "title": "We're searching for moderators!",
  "author": "ExxPlore",
  "body": "<p>Good news: It has taken Paxterya 4.5 months before being griefed for the first time! The damage already undone and the griefers banned, we decided this is the perfect time to expand the staff team of Paxterya. Only whitelisted Paxteryans can apply to become a moderator.</p><br>\n\n<h3>What do I have to do as a moderator?</h3>\n<p>Moderators, along with the admins, enforce these rules: <a href=\"https://paxterya.com/rules\">https://paxterya.com/rules</a>. This is done in the following way:</p>\n<ul class=\"rules\">\n<li>For minor rule violations, such as insults: Remind of the rules and speak out a warning.</li>\n<li>For major rule violations, such as griefing: Ban the griefer.</li>\n<li>Of course, every situation is very unique and there are no universal instructions. This is why we as a team keep each other informed about any incidents on the server and discuss what we should do about it. For very urgent matters like a griefer going around, a moderator can ban him instantly and then inform the team.</li>\n</ul><br>\n\n<h3>What are the requirements?</h3>\n<ul class=\"rules\">\n<li>Be somewhat active.\n\t<ul style=\"margin-left:20px;\">\n\t\t<li>You don't have to be among the most active players and be in-game every day; rather, you should be there for the members as a person of trust when you <i>are</i> online in Minecraft or on Discord.</li>\n\t</ul>\n</li>\n<li>Be a role model.\n\t<ul style=\"margin-left:20px;\">\n\t\t<li>This is a no-brainer: Before enforcing the rules, you should follow them yourself. Doesn't mean you have to act all serious at all times.</li>\n\t</ul>\n</li>\n<li>Stay level-headed and impartial.\n\t<ul style=\"margin-left:20px;\">\n\t\t<li>In a heated situation, don't feel pressured to act instantly. Rather, look if and which rules have specifically been broken and act accordingly. Again, we're stronger as a team!</li>\n\t</ul>\n</li>\n</ul><br>\n\n<h3>How do I apply?</h3>\n<p>On Discord, send a direct message to one of the admins TxT or ExxPlore with the following points:</p>\n<ul class=\"rules\">\n<li>Do you have previous experience running/moderating a Minecraft or other community? Either way: How do you think a moderator should behave?</li>\n<li>How reachable are you on Discord and when (time zone)? (Note: We know you have a life too, you're not expected to be reachable at all times.)</li>\n<li>Anything else you'd like to say</li>\n</ul><br>\n\n<p>The applications are open for <b>48 hours</b> now! After that, <b>your application will be published and the Paxteryans will vote.</b> We decided to take this rather democratic approach, so please only apply if you feel comfortable with your application being published to the other Paxteryans!</p>",
  "date": {
    "$date": "2020-04-18T22:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5e9ecfd6f7548969c76f590c"
  },
  "id": 16,
  "title": "Voting for moderators - Have your say!",
  "author": "ExxPlore",
  "body": "<p>Two days ago, we announced we were searching for moderators. We'd like to thank all the six applicants for their commitment to keep Paxterya peaceful!</p>\n\n<h3>How do we go on from here?</h3>\n<p>All Paxteryans can now read the six candidates' applications, further down in this post. There's a strawpoll link for each candidate where you can vote if you'd like to see them become a moderator or not. <b>The final decision will be made by the admins</b>, based on the voting results. The <b>voting phase lasts 24 hours</b> from now on. Tomorrow, we will then announce the new moderators in another blog post! Happy voting, here are the candidates' applications:</p>\n\n<hr style=\"margin-top:20px;\">\n\n<details>\n    <summary>In_The_Pines</summary>\n    <p>I have at least 4-5 years of experience running/moderating a Minecraft community, as well as backend work doing mods like worldedit/ rollback, world mgmt. and just general command work/custom scripting (a bit but not too much scripting)<br><br>\n\n I think a moderator should be kind and neutral but firm and remain levelheaded at all times... being just but fair and hearing people out yet able to discern right from wrong and act accordingly. And also it’s a moderators job to Watch chat carefully at all times and be active and chat (including wanting to help players). but be kind and if anything happens mildly bad in chat, tell people to calm down and try to even out the situation. But also it’s a moderators job to report any foul things going on that they have no power to fix, to you or exxplore ASAP so that you guys can fix/correct the problem.   Also I think it’s a main moderators job to be friendly and welcoming and helpful to all on the server no matter what and to hold no grudges even if another player hates you. <br><br>\n\nI am in the Pacific Time zone on the west coast of the USA and I’m reachable at all times no matter what , 24/7/365 (which means that I am even on *sometimes when the Europeans are asleep) <br><br>\n\nAnything else I want to say?  well hmm... I think that you guys are awesome and doing a great job of running the server.  I really like this server so far and I hope that I am able to fill the position of moderator for you because I promise you that if I do get to help you, I promise I won’t let you down. My main goal is to prove to you guys into the community that I am honest and trustworthy and can be kind and fair and I do want to help— both ways still if I’m am allowed to help as a moderator— But even if Not, so that perhaps one day I might be able to.  I hope this makes sense.  Regardless I like it here and I plan on staying for a while— as long as I’m allowed to<br><br>\n\nI almost forgot to say just one last thing... sorry.  I’m glad you like the application and I hope that it’s OK and acceptable, to your favour/liking and that I meet Almost all, if not all, of the qualifications.<br><br>\n\nsorry for the application being so long. Though the one thing that I wanted to say in closing—- I definitely agree that a moderators position should be also with reporting stuff to you guys (within my capacity), giving verbal warnings in chat where needed sometimes, timeouts if needed, and also bans but only if absolutely necessary for Repeat offenders who have already been warned or given time outs or been kicked. But never abusing the power— ever— because doing that would be a complete betrayal of trust and compromise of position On the server as a moderator and within the community, not just to you and exxplore but to everybody else.\nNot to mention that would show that if one were abusing Power as a moderator that they do not know how to do their job correctly or efficiently and should be removed from said position effective immediately after, as well as giving a verbal warning (if not being banned). though that fate would then be up to the server admins.<br><br>\n\nAlso it’s a moderators job to be in cohesiveness and oneness not just with the community but with the fellow moderators and admins, Transparent in everything... but communicating often and openly with one another. So that if the situation comes up the story can be corroborated.<br><br>\n\nSay for example — a player is starting arguments and chat and the argument gets handled by an moderator or admin if another one is present (or even a player) then they can back up that others person’s story, Whether it be of the player or the witnessing/handling moderator.... Though it would probably normally be between moderators/admins because if left to a player could get kind of confusing. If this makes sense?<br><br>\n\nanyway that’s pretty much all I had to say is that I agree about being able to do what needs to be done I want to situation by situation basis as necessary.\nThat’s all I guess.   Sorry for my rambling</p>\n</details>\n<a target=\"_blank\" href=\"https://www.strawpoll.me/19830629\"><button>Vote on In_The_Pines</button></a>\n\n<hr style=\"margin-top:20px;\">\n\n<details style=\"cursor:pointer;\">\n    <summary>TestyMonkey</summary>\n    <p>• Do you have previous experience running/moderating a Minecraft or other community? Either way: How do you think a moderator should behave?<br><br> I have experience with core protect, although I have never moderated before. I tend to think that a moderator should be an “advisor” of sorts. Everyone plays this game differently, and an advisor’s job should be to facilitate players reaching their goal and working as an intermediary should there be a conflict and attempt to find creative solutions. With respect to how the actual moderator should behave, effectively like every other player (/tp only in emergency, no use of the /give command, etc.). The best servers I have been on, it took a few weeks to figure out who is a mod indicating that personal relationships were emphasized over “titles”. <br><br>• How reachable are you on Discord and when (time zone)? (Note: We know you have a life too, you're not expected to be reachable at all times.) <br><br>Most days, 4pm-9pm Eastern Time in the USA. We are 8 hours ahead of GMT. <br><br>• Anything else you'd like to say<br><br> At 39, I think I am twice the age of the mean players on the server. I am primarily a builder and we’re trying to start a new town to the south… but I do a bit of redstone and love mob transport (villagers are a little boring. Blaze, elder guardians, guardians… those are fun). Also a fan of hermitcraft. BDubs is my favorite builder of houses, Scar for terraforming and Tango just for his hijinks. </p>\n</details>\n<a target=\"_blank\" href=\"https://www.strawpoll.me/19830630\"><button>Vote on TestyMonkey</button></a>\n\n<hr style=\"margin-top:20px;\">\n\n<details>\n    <summary>MrSprouse</summary>\n    <p>-Do you have previous experience running/moderating a Minecraft or other community?<br><br> Yes, I ran three iterations of the CookieCraft server. I wasn't great at actual Server Management, but I was ok at being a moderator. <br><br>-How do you think a moderator should behave? I think a mod's behavior should be a refection of the rules. <br><br>-How reachable are you on Discord and when (time zone)?<br><br> I am in UTC-4, and I am usually available from 10am-1am (with a few exceptions). -I don't want to sound like a complete dick, but I really feel like I should get this. When the griefing attack started, I was able to get on pretty much as soon as I got the discord message. Also, this is something that that we should have had since the beginning. There are so many instances where where you guys were offline and a moderator was needed. </p>\n</details>\n<a target=\"_blank\" href=\"https://www.strawpoll.me/19830632\"><button>Vote on MrSprouse</button></a>\n\n<hr style=\"margin-top:20px;\">\n\n<details style=\"cursor:pointer;\">\n    <summary>swabfu</summary>\n    <p>co-owned a small server with my friends last summer, i've also been mod to some discord servers over the years.<br><br> i don't have much quantitative experience compared to others (others probably have much more servers they've managed) but i'm always very active on discord and quick to respond (after around midnight cet i'll go offline till around 7-8am) and even though I have school, i often do quick discord checks between classes. also, i may not have managed many servers but i'm always one to try to make the best out of a messy situation. a mod should behave as a role model, though they shouldn't be too serious either. they should make sure to stop any rowdy, unfriendly behavior that goes against the rules by giving them a warning. if the action done is serious, or they ignore the warning, you should ban them. <br><br>if you have some sort of bias in a situation/you don't know what to do/you're neither calm nor thinking rationally/the offence committed is huge, you directly notify the admin team. for anything you can manage on your own, you take your own actions, but still inform the admins thereafter. if the issue can be handled easily but you can't take a decision and you don't want to bother the admins, contact another mod for help<br><br> tl;dr make sure you're making the server a better place but dont abuse your power. stay calm and think things thru, but be an all around nice guy </p>\n</details>\n<a target=\"_blank\" href=\"https://www.strawpoll.me/19830634\"><button>Vote on swabfu</button></a>\n\n<hr style=\"margin-top:20px;\">\n\n<details>\n    <summary>ChryoFyre</summary>\n    <p>I am applying to be a moderator. I have not been one before, but I believe a mod should be the one to settle disputes, and uphold the rules around the server. They should be strict, but still able to have fun and not ruin everything for everyone else. They're just there to watch over the server and make sure no bad things happen, but they don't get directly involved in every little thing. Also I'm in Central Daylight time, so that might be a bad thing since most people are in Europe.</p>\n</details>\n<a target=\"_blank\" href=\"https://www.strawpoll.me/19830639\"><button>Vote on ChryoFyre</button></a>\n\n<hr style=\"margin-top:20px;\">\n\n<details>\n    <summary>Aavoxx</summary>\n    <p>I do have previous experience as a mod on small servers, I know how to settle disputes and handle rowdy players, because at the end of the day we're all just relaxing playing a block game. I am very reachable on Discord, being in the EST timezone. Another thing, I would like to become a mod to bring peace to Paxterya. All too often the chat is being spammed with petty arguments and insults and I would like to reduce some of that by becoming a mod.</p>\n</details>\n<a target=\"_blank\" href=\"https://www.strawpoll.me/19830642\"><button>Vote on Aavoxx</button></a>\n",
  "date": {
    "$date": "2020-04-20T22:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5ea03096eb1ef94a7a788f8b"
  },
  "id": 17,
  "title": "Introducing: Paxterya Moderators",
  "author": "ExxPlore",
  "body": "<p>The moderator voting phase is over! We'd like to thank all six applicants for their interest to invest time into keeping Paxterya an enjoyable experience! Also thanks to all the Paxteryans who took their time reading the candidates' applications and sharing their opinion.<br>\nNow I'm happy to announce that the Paxterya staff team now counts five people! TxT and I agreed to realize the voting results as they are, meaning that the new moderators are <b>TestyMonkey, MrSprouse and swabfu</b>. Congratulations to you three!</p>\n\n<h3>What happens now?</h3>\n<p>The moderators will get special permissions both in-game and on the Discord server to be able to act on urgent matters. Apart from that, they will be recognizable by a Discord role and a Minecraft prefix, so especially new members know who to go to if they have any questions or concerns. If an event like the attacks of April 19th (that's its dramatic name now!) happens again, we should now be able to resolve the situation faster!<br>\nTo the applicants who unfortunately didn't become a moderator: We hope to see you on board if we ever need to further expand the Paxterya team! With that, thanks again to the applicants and the voters, and see you in-game!</p>",
  "date": {
    "$date": "2020-04-21T22:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5eb14c4847e8b47619626d91"
  },
  "id": 18,
  "title": "Paxterya Recap #8: The big Town influx",
  "author": "ExxPlore",
  "body": "<p>Hello? Is this thing still working? <i>*Blows dust away*</i> R-E-C-A-P-8. Yes, indeed! The longer we're into the season, the rarer those recaps get. Not because there's nothing to report, but rather because there's too much to report.</p>\n\n<h3>An incomplete list</h3>\n<p>Trying to list all the changes since the last recap nearly two months ago is futile, but here's my best attempt: There are the new towns Turtle's Cove, HobbitVille and the Independent Southern Alliance (ISA), all deserving their very own blog post because they're looking amazing! Then there's the Paxteryan Railway which is still being worked on, now also being connected with a harbor to get to Paxendorf, and a railway to the new HobbitVille is on the way!</p>\n<p>The Town of Paxterya (TOP) in the meanwhile still keeps growing, now even spreading over the boundaries of the town's territory! So my new base, once finished, will technically not be in the capital, but almost! This annexation of no man's land has proven that the rise of the Town of Paxterya is unstoppable. It is the town to go to! (Paid advertising, sponsor: TOP tourist office.)</p>\n\n<h3>Hermiterya</h3>\n<p>We all love Hermitcraft. Most of us anyway. Some of us even so much they mimic their games! The game of demise has been running for weeks now, even with a Saturator™ for the demised in place. When all but one contestants finally died, remind me to announce the winner in the next blog post!<br>And there is (or was) another game of the Hermits: In the new mall section of the Nether hub, you find the Button™! Although it seems it has already died. Rest in peace, Button™.</p>\n\n<div class=\"article-img big\">\n<picture>\n       <source srcset=\"https://stor.paxterya.com/website/articles/013.webp\" type=\"image/webp\">\n        <img src=\"https://stor.paxterya.com/website/articles/013.jpg\">\n</picture>\n  </div>\n\n<h3>Website development going big</h3>\n<p>The quarantine seems to have sparked some creativity in TxT and me, and so we've been making more progress on the website than usual. What's entirely new is the landing page which serves as an overview for people who don't know Paxterya yet. Paxterya.com is still far from finished though! Expect to see some performance optimizations and new and better features. And as always, your suggestions for changes are more than welcome!</p>\n\n<h3>Promote your town!</h3>\n<p>With the shameless ad for TOP in the first paragraph, it's only fair if other towns get to promote their town as well. So if you're in a town you feel could do with some publicity, contact ExxPlore on Discord with your advertising idea! It can be anything; a text, a poster, a video, a tale, … we'll be happy to show it off in a blog post and put it on your town page!</p>\n\n",
  "date": {
    "$date": "2020-05-04T22:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5f061332dc90ad0011e798c3"
  },
  "id": 19,
  "title": "Season 4 Plans & Your Opinions",
  "author": "TxT",
  "body": "<p>\n          This is the first time I am writing one of these blog posts, so I hope that I will do an ok job here.<br>\n          Anyways, let's get into the interesting stuff: <b>Season 4!</b> There is already a <a href=\"https://www.youtube.com/watch?v=y8yxh_VYIrc\">trailer</a> on our <a href=\"https://www.youtube.com/channel/UCH-JgwSf8J8tdjemXqihEKw\"> YouTube Channel</a>, but there are still a lot of details to discuss.<br>\n        </p> \n        <p>\n          Before getting into any of the nitty-gritty details tho, I must preface them by telling you that nothing is final and everything subject to change. \"What might cause these to change?\" You might ask. Well the answer is: \"You!\". That's right: We want your feedback. Please read everything carefully and then tell us what you think over in #paxterya!<br>\n          Okay, but now let's get this train going!\n        </p>\n        <h3>(Public) Farms</h3>\n        <p>  \n          This is a difficult one as there two kinds of players: Communists and Capitalists. <i>Well also a few that don't care.</i><br>\n          Now it's our job to strike a balance between both playstyles. The problem with having public farms is that they completely destroy the experience of players that like building farms <b>and</b> selling their items.<br>\n          We think that we found a good middle-ground by having a list of farm types that are allowed to be public and free:\n        </p>\n          <ul class=\"rules\">\n            <li>XP farms of any kind</li>\n            <li>Villager trading halls</li>\n            <li>Iron farms</li>\n            <li>(Cobble)stone farms</li>\n            <li>Wool farms</li>\n            <li>Manual mostly decorative farms (like the public field in TOP)</li>\n            <li>Gravity duper</li>\n          </ul>\n        <p> \n          Just because a farm is on this list does <b>not</b> mean that all farms of the type need to be free to access and use for all players.<br>\n          Also all public farms need to be approved through the moderators and admins. The goal is to better coordinate and plan building these public farms, so we can ensure optimal location, efficiency and performance optimization.<br>\n          This would be beneficial for performance reasons as we can hopefully reduce the number of these farms on the server. Especially villager trading halls are slowing the server down quite significantly.<br><br>\n          Farms that are not on the list need to be operated either completely privately (Only use the items for yourself) or the items need to be sold for valuables (like diamonds). Massively undercutting prices of competitors is not allowed. Staff will decide what these boundaries exactly are on a case-by-case basis. Small gifts and random acts of kindness are obviously also allowed (like gifting a new player a few rockets). Just be responsible and don't destroy the fun (and profits) of other farm owners. \n        </p>\n        <h3>Towns</h3>\n        <p>  \n          First up: If you are currently a mayor, then you will need to reapply, as no towns are going to carry over automatically.<br>\n          Towns are pretty central to the experience on Paxterya and we only want to improve on that front. Towns are great as they cluster players together and produce more cooperation, which is great for the community feeling. That's why we want to reduce the overall amount of towns to boost larger towns.<br>\n          To do that, we are now going to enforce the 5 citizen minimum when founding a new town. This newish threshold also applies to currently still existing towns. We hope that this will result in larger towns, like Paxterdam which is pretty huge.<br>\n          Not all players are motivated to stay on Paxterya for many months at a time, so we end up with inactive players. Every couple of months we mark players that haven't played in a month inactive. That already affected mayors, which raised the question of what should happen to their towns.<br>\n          Introducing: Ghost towns! A town will be declared a ghost town when it has no active citizens anymore. A ghost town will remain visible on dynmap, but it will be forbidden to build in them.<br>\n          To keep track of citizenship, we are going to utilize Discord roles for now. We are planning to integrate that into our member-only interface in the future, but for now this simple solution will do just fine.<br>\n          This means that you will need to tell a mod or admin when you change citizenship. For now I think a limit of two towns you can join as a citizen should be decent.\n        </p>\n        <h3>Datapacks & Plugins</h3>\n        <p>\n          On the plugin side there won't be any change for now. This means we will keep using CoreProtect, DiscordSRV, Dynmap, Worldborder (Set to 20kx20k blocks for the start, but expanding over time) and of course our own PaxteryaPlugin (terrible name I know).<br>\n          In terms of datapacks we will change things a bit around. We plan to use silence mobs, durability ping, custom armor stands, multiplayer sleep, coordinate HUD and last, but not least nether portal coordinates. Most of them are already on the server, but broken. I hope that I can get them all working now tho.<br>\n          We had a bit of a difficult time with datapacks that modify vanilla crafting recipes. There is one that sounds very useful as it allows you to craft some things, that would normally require a crafting table, in your inventory. We are unsure if this is a good thing to add, so we made a <a href=\"https://www.strawpoll.me/20540153\">strawpoll</a> where you can voice your opinion.\n        </p>\n        <br><br>\n        <p>\n          I think that was everything we wanted to discuss for now. Again, if you have any opinions on our proposed changes, then please discuss with us in the #paxterya channel.<br>\n          Another blogpost detailing our new hardware and server setup will come online tomorrow! (No worries, I will try to make it not too dry and technical). I will then create another blogpost a couple of days before the launch of Season 4 (July 18th, mark it in your calendars!), which will go into all specific changes to the gameplay experience!\n        </p>\n        <p>\n          I hope my blogpost wasn't to boring to read, cheers ~TxT\n        </p>",
  "date": {
    "$date": "2020-07-07T22:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5f075dd5dc90ad0011e7de4f"
  },
  "id": 20,
  "title": "Our New Hardware (And Software)",
  "author": "TxT",
  "body": "<p>\n          While I tried to write everything in a sort of understandable way, I have probably failed. If you want to know more or didn't understand something please ask in #technology in Discord or DM me (TxT#0001).\n        </p>\n        <h3>Our old server</h3>\n        <p>\n          Before writing about the new, I should probably provide some context by talking about the old.<br>\n          Since about 10 months we are using a dedicated server with moderately performant internals. As a processor it is running an Intel Core i7 6700, which is now four generations old, but was pretty top of the line in terms of gaming performance when it launched back in 2015.\n          For Memory we have 64GB of DDR4 RAM, which is more than plentiful for running \"only\" a Minecraft server.<br>\n          Storage is also relatively important, but our two 512GB NVME SSDs are plenty fast on paper, although they seemed to have some problems and showed signs of aging. Most servers use multiple storage devices together in a RAID. This just means that you can pool storage devices together, in our case with a RAID 1 one drive could have died and you wouldn't even have noticed it. On the downside this also costs one drive worth of storage that you cannot use.<br>\n          In summary, this was a fine server for its price, but big farms, tons of villagers and a lot of sheep in the spawn chunks demanded some more potent hardware. I also had to get creative to reduce the storage needs of our dynmap (at some point it used 200GB of storage).\n          <br>\n          We also had two more so-called \"cloud\" servers. These are small virtualized servers running on a bigger one. This allows a hosting company to split a single powerful server into many smaller slices that they can sell for a much cheaper prize.<br>\n          Our website and Discord bot ran on one of these and all the performance monitoring ran on the other one.\n        </p>\n        <h3>Lessons learned</h3>\n        <p>\n          It is always important to reflect what you have done and look at the past to find things you have done wrong or not optimally. I don't think that anything about the hardware choices is wrong, we just outgrew it, which is natural and a good thing.<br>\n          Well that leaves the software side. We had one fairly powerful server, yet we also rented two more cloud servers for seemingly no real reason. Was the main dedicated server to weak? No. Would anyone have noticed any slowdown if everything would have been centralized? No.<br>\n          Why did you do it that way then? Well, running a lot of different software pieces together like that poses a handful of challenges:<br>\n          First of all there is the security and stability angle. You don't want software A to access the files of software B. Say, software A has a newly discovered security vulnerability that allows random hackers to access files that software A has access to. If everything is shielded off, that's unfortunate but not a problem of \"nuclear\" scale. The same problem can also be caused by bugs and so on.<br>\n          The second thing to consider is performance. Databases in particular are known for using a lot of RAM for things like caching. That means that the database doesn't need to read everything from the slower disks all the time, instead they can get their data from the much faster memory. This is all fine and good until you need to run multiple different databases that take all of the systems memory hostage for their caching needs.<br>\n          The third reason also has its place, but hasn't been an issue for us yet. Its dependencies. Let's say software A needs software C installed to function. software B also needs software C. All fine and good, until A and B need different versions of C. But C doesn't like to be installed twice...<br>\n          Good solutions to these problems (and I probably forgot a few more) exist and I will discuss our new approach in the \"New software\" section. Limited knowledge on my part meant that the best solution to me was just running three servers.<br>\n          You might ask what the problem with running three servers instead of one is. The answer is simple: Work. Say there is a new vulnerability in sshd (the piece of software that let's me connect and manage the servers remotely) and I want to apply the software update. With three servers I have to do the process three times, with one server it only needs to be done once. This is obviously one example of many. Another might be the amount of passwords to \"remember\".\n        </p>\n        <h3>New hardware</h3>\n        <p>\n          Okay, now let's finally leave the boring past behind us and talk about the new hardware. For the processor we went with a system equipped with an AMD Ryzen 3900. It not only has three times as many cores as our old i7, it also has more performance per core. The singlecore performance bump is what will hopefully help Minecraft to run faster. The tripling of cores is what is going to allow us to run multiple server simultaneously (like our new creative server).<br>\n          Memory was plenty even on our old server, but our new one comes with a sweet doubling to 128GB. That much memory has a nice advantage tho: Caching. I talked about caching of databases earlier, turns out linux (the only real server operating system ;) ) also does caching for everything stored on disk. So, having enough memory will help with stuff like restart and save times of gameservers.<br>\n          Our storage is probably the biggest increase. It is almost four times as large with two 1.92TB of (again) blazing fast NVME SSDs. We can only use 1.92TB because of RAID. But that means that one SSD could die and the only one who would notice it is me.<br>\n          We also still have one cloud server because that was just the easiest route to get our new gameserver hosting software going. More on that in the following section.<br>\n          All in all, we made a pretty solid deal. Paying about twice as much for 3x the CPU cores, 2x the memory and 4x the storage capacity.\n        </p>\n        <h3>New software</h3>\n        <p>\n          The \"Lesson learned\" section goes into a lot of detail about separating software for various benefits. Now let's talk about the solution.<br>\n          Well not so easy. There are actually two solutions, one older one and one that's fairly new. The old one is called virtual machine. These virtual machines date back into the late 60s and are described by wikipedia as the following: \"In computing, a virtual machine (VM) is an emulation of a computer system. Virtual machines are based on computer architectures and provide functionality of a physical computer.\".<br>\n          Okay great, but what does that mean? Well a virtual machine is basically a program running on a physical computer or server. Inside of that \"program\" there are one or multiple fully operational operating systems. All the hardware of a VM doesn't <i>actually</i> exist. It is all running in software. Each network adapter, every storage disk. Nothing is real. Well of course there are many optimizations, code and programs that run inside the VM can actually be executed directly by the processor without any kind of translation and memory is also directly accessed, yet separated between VMs and the physical host system. You might see some virtualization related options in your computers BIOS settings, these allow various things like enabling direct hardware access, while keeping everything nice and separated.<br>\n          That separation is why VMs are great and still widely used today. Every VM running on the physical host runs its own full operating system (including the kernel, the bit of code closest to hardware in an operating system). This carries a huge benefit: Using different operating systems on one physical computer/server. This allows you to try out linux or even macOS on your windows PC without needing to worry about loosing any data. The strong separation also allows you try out viruses inside a VM without it effecting anything else (you still need to be careful that there is absolutely no connection like networking!!).<br>\n          If it sounds to you like that's a massive amount of overhead for when you don't actually need that strong separation, then well, you're absolutely right. The overhead isn't that huge, but it can be a lot of work to manage multiple VMs, when you could have used something leaner instead.<br>\n          That leaner technology has many names: Containers is probably a good one. Many people also refer to it as \"Docker / Docker containers\" tho, because that's the specific piece of extra software that made containers as popular as they are today.<br>\n          Containers are enabled by a future in the linux kernel (only one of many reasons why linux is awesome) called namespaces. What that means is, that, all running containers and the host use the same kernel. All software running in containers is then separated off just by the fact that it is in a different namespace with limited access to processes running in other namespaces. Containers also only have very limited access to the filesystem of the host.<br>\n          This eliminates overhead caused by virtualization. The real advantage and power of containers lies in more modern principles. Containers should be stateless, that means that they should not contain any data. Data should be stored in special volumes that can outlife a container, in a database or directly on the host filesystem. This allows you to delete and rebuild a container without losing any data.<br>\n          Installing new software is as easy as copying the contents of a special <i>docker-compose.yml</i> file to your host, modifying a few bits to suit your needs and then running the command <i>docker-compose up -d</i> is all you need to do. After leaning back for a short bit while docker downloads everything you are left with a new application running. This application can consist of multiple containers, volumes, shared network ports, private networks for the containers to communicate with each other and so much more. Meanwhile in the old days you would have needed to install the operating system, dependencies, the software itself and then configure all the dependencies so they work with the software you actually want to use.<br>\n          Okay so, containers are great, but do you know what's even greater? Images! Well not the kind of images you take with your phone. I mean the images that represent the \"hard disk\" storing all the software components of a container. In fact, a container is just the running state of an image. Images in docker are simply amazing, because they have <i>layers</i>. Your first layer might be a distro of linux, like alpine which is specifically made for running in containers. The second one could contain all the dependencies you need and the third the actually application you want to run. Now when updating your application, the layers of the OS and dependencies can stay the same. When you then want to deploy the new image on your server, you only need to download and store the new application layer. When you create a container based on an image, a new layer gets created that contains all the changes the container makes when running (like writing log files).<br>\n          I could probably fill many more overly long blog posts with talk about containers and docker, but I will stop now.<br><br>\n          We went down the docker path for our server. As of right now we are running seven containers, these are databases, monitoring tools, the creative Minecraft server (and soon the SMP) and also our website.<br>\n          For this to work I had to create my own docker image for the website/discord-bot.<br>\n          As a programmer you write code. Storing that code only on your computer in plain files is a horrible idea, because what do you do when you want to share your code with others, and, even worse: What happens when others have changes for you? How do you incorporate these into the codebase? What do you do when you also changed some of the same parts of the code? You cry. And then you start using git. Git is a protocol that allows you to store code on a central server, every developer can then check out code, work on it locally and, when done, push the changes back to the central server. To make it easier there is a neat feature called branches. Different branches don't affect each other. So you could implement new features in one branch that might break stuff short-term, while fixing important bugs in your main branch. When you're done implementing the feature, you can just merge the changes back into the master branch. While doing that you might have to resolve some merge conflicts, when different changes from both branches collide. You could just run a git server yourself, but there are some code-collaboration platforms that are build ontop of git and have more features like issue tracking. One of these is Github and we did use that for almost a year before switching to Gitlab a few weeks ago. I really love Gitlab so far as it has some more features than Github (like a darkmode!).<br>\n          One of the things that Gitlab is pretty good at is doing things with your code automatically (called CI/CD). Github now also has expanded in that regard, but whatever. Why am I telling you all this? Well, I had the challenge of needing to build my own docker image and I just wanted to brag how easily I did that with Gitlab. Now every time I push code to the main \"master\" branch, Gitlab automagically builds a new image based on a <i>Dockerfile</i> that's also part of the codebase. The Dockerfile just gives build instructions, like which files should be put where, which commands need to be run to install all necessary stuff, etc. No more than five minutes after I pushed code to master, I can pull the changes on the server to update the image, send another command to rebuild the running container and then everything is up-to-date. I can even see the status of the image build right inside of my programming tool (IDE) Visual Studio Code.<br><br>\n          Okay I think this section is already waaaay to looooong, so imma make the last thing quick (I promise).<br>\n          That would be the software to run the Minecraft server(s). Sure, I could just use some Minecraft server container and call it a day, but that's hard to manage. In the past we used multicraft, which you might have used already when renting a Minecraft server at ceratin hosting companies. Multicraft is nice, but basically not possible to run inside a container. Well, it is possible, but then all Minecraft servers would run inside of a single container, which is not ideal. Instead I chose to go for Pterodactyl, which not only looks more modern, but it also has a better feature set enabling you to do more things like limiting memory, CPU usage, storage space and even prioritize storage access for some containers. Pterodactyl also goes beyond just running Minecraft servers. The list of supported games is long and growing.<br>\n          Now I will stop with this section, when you want to know more about what Pterodactyl can do, just hit me up on Discord and I will write a follow up in the future, when I gained more experience.\n        </p>\n        <h3>The future</h3>\n        <p>\n          An outlook into the future is also fun. It is also always something that can age horribly wrong, but hey, let me give a try. \"Our current hardware will be plenty for at least a year, probably two\" -TxT 2020.<br>\n        </p><br>\n        <p>\n          Well I had a lot of fun setting everything up, installing and configuring everything and writing this post. If you have any questions about literally anything related to the new server, just ask in our discord in #technology or shoot me a DM (TxT#0001).<br>\n          Also let me know if you want more behind the scenes posts like this one, I could imagine that a post about the inner workings of our website, discord bot or Minecraft plugin would be interesting to some.<br>\n          Cheers ~TxT\n        </p>",
  "date": {
    "$date": "2020-07-09T00:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5f104912698a9e0147042e1f"
  },
  "id": 21,
  "title": "Season 4 Details",
  "author": "TxT",
  "body": "<p>\n          In this blog post I will be writing about all the information you need to know for the new Season!<br>But first let's talk about tomorrows anarchy day!\n        </p>\n\n        <h3>Anarchy</h3>\n        <p>\n          Almost everything thats needs to be said got already said in the bulletin in our bulletin board (More on that further down).<br>\n          There are just two things that people seemed to be confused about: <b>No hacks are allowed</b>, also no one (not even mods and admins) will get OP rights during the event.<br>\n          I will shut the server down three hours before the start, thats at 3pm CEST, so I can take a <i>working</i> world download before the event starts at 6pm CEST.<br>\n          Also, <b>do not grief, steal or do anything else thats against the rules before the anarchy starts!</b>\n        </p>\n\n        <h3>Survival details</h3>\n        <p>\n          Okay, now lets talk about the truly interesting stuff: Season 4! I already overloaded you with infos two blog posts ago and asked for your opinions. Not much has changed, but I am going to recap everything in this post and make it a bit more pleasantly organized.\n        </p>\n        <p>First up: island in the north-east is reserved for the Town of Paxterya. You are allowed to build a house, but it would be nice if you consult with TxT before permanently settling there.</p>\n        <br>\n        <p><b>Nether:</b></p>\n        <ul class=\"rules\">\n          <li>All transportation in the nether is supposed to happen on the nether roof</li>\n        </ul>\n        <br>\n        <p><b>The End:</b></p>\n        <ul class=\"rules\">\n          <li>It is forbidden to enter the end before the first dragon fight event, which will be announced by the admins</li>\n          <li>The end island is to be kept free of buildings, so the dragon can be fought at any time</li>\n          <li>Dont build outside of 2000 blocks away from 0/0</li>\n          <li>The extended end (everything outside of 2000 blocks from 0/0) will be reset once a month</li>\n        </ul>\n        <br>\n        <p><b>Shopping district:</b></p>\n        <ul class=\"rules\">\n          <li>The location of the shopping district will be announced once the season started</li>\n          <li>Each plot is 16x16 blocks large</li>\n          <li>A plot can be purchased for 1 diamond block</li>\n          <li>All the proceeds of selling plots go towards a pile of diamonds blogs in the center of the shopping district</li>\n        </ul>\n        <br>\n        <p><b>Public farms:</b> Only the following types of farms are allowed to be public:</p>\n        <ul class=\"rules\">\n          <li>XP farms of any kind</li>\n          <li>Villager trading halls</li>\n          <li>Iron farms</li>\n          <li>(Cobble)stone farms</li>\n          <li>Wool farms</li>\n          <li>Manual mostly decorative farms (like the public field in TOP)</li>\n          <li>Gravity duper</li>\n        </ul>\n        <p>If you want to build one of these kinds of farms for public use, then you need to consult with a mod or admin beforehand.</p>\n        <p>You dont need to make your farm public, just because its on this list, although you should consider if you need to build one yourself. Consider the server performance.</p>\n        <p>Farms not on the list must be run privately. That means that access to the farm, as well as its items cannot be given away for free for all (or a big portion of) players. You are also not allowed to massively undercut prices of competitors (like selling 1 stack of gunpowder for 1 Dirt)</p>\n        <p>For more information on this topic, please read the the blog post \"Season 4 plans & your opinions\" further down.</p>\n        <br>\n        <p><b>Towns:</b> To start your own town:</p>\n        <ul class=\"rules\">\n          <li>Gather at least 4 more people</li>\n          <li>Search a spot that is not too close to other bases/towns (consult dynmap)</li>\n          <li>DM an admin</li>\n        </ul>\n        <p>Citizenship:</p>\n        <ul class=\"rules\">\n          <li>To gain Citizenship in a town contact the mayor, who will need to contact a mod</li>\n          <li>You can only be a citizen of two towns at once</li>\n          <li>To leave a town, contact a mod</li>\n        </ul>\n        <p>Ghost towns:</p>\n        <ul class=\"rules\">\n          <li>A town turns into a ghost town when the mayor is inactive</li>\n          <li>All citizens loose citizenship of the town</li>\n          <li>It remains visible on dynmap</li>\n          <li>No one is allowed to build anymore</li>\n        </ul>\n        <br>\n        <p><b>Plugins:</b></p>\n        <ul class=\"rules\">\n          <li>Our own PaxteryaPlugin for /afk, /dm, /gdm and prefixes+permissions</li>\n          <li>Coreprotect</li>\n          <li>Dynmap</li>\n          <li>DiscordSRV (#survival-in-game-chat)</li>\n          <li>Worldborder (20kx20k at first, expanding over time)</li>\n        </ul>\n        <p><b>Datapacks:</b></p>\n        <ul class=\"rules\">\n          <li>Singleplayer sleep</li>\n          <li>Silence mobs</li>\n          <li>Durability ping</li>\n          <li>Custom armorstands</li>\n          <li>Coordinate HUD</li>\n        </ul>\n        <br>\n        <p>Phantoms will be enabled, but this might change in the future. We will probably hold another poll in a few months</p>\n\n        <h3>Creative server</h3>\n        <p>\n          The creative server (paxterya.com:25566) is now also up and running for a while and now uses the same plugins as the survival server as well as worldedit.<br>\n          You also get some more commands to use like /gamemode, /time, /effect and /tp<br>\n          Please be responsible, dont build too close to others (the map is invinite) and try not to lag the server too much.\n        </p>\n\n        <h3>Bulletin board</h3>\n        <p>\n          I also want to use this opportunity to tell you about the bulletin board. You can access it by clicking the login button on our website. Then you need to authenticate with the same Discord account you use on the server.<br>\n          Once logged in, you can see all bulletins and create new ones.<br>\n          Please mark your shops on the bulletin board, so everyone can find what they need quickly.\n        </p>",
  "date": {
    "$date": "2020-07-16T00:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5f1efa9f234b210113b2216b"
  },
  "id": 22,
  "title": "The Paxterya staff wants you!",
  "author": "ExxPlore",
  "body": "<p>About three months ago, TxT and I searched for moderators to better organize the peaceful coexistence on Paxterya. We're very thankful for PrimateAfterMath's, MrSprouse's and swabfu's contributions to this community! With ExxPlore going abroad for a year and TxT wanting to focus more on the development side of Paxterya, we judged it is time for another application round!</p>\n\n<h3>What do mods do?</h3>\n<p>The moderators' responsibility is to keep the vibe on Paxterya peaceful and positive, enforcing the <a href=\"https://paxterya.com/rules\">rules</a> by reminding of them and if necessary kicking or banning players.<br>Moderators also get access to CoreProtect, so they can inspect and undo any griefing or stealing. For such moderation purposes only, they are allowed to teleport or use gamemode.</p>\n\n<h3>Who can apply?</h3>\n<p>We decided to open the applications only for people who have already been on Paxterya since at least June 18th (1 month before Season 4). This way, we know the applicants are likely to stay active members of Paxterya for a reasonable amount of time.</p>\n\n<h3>How do I apply?</h3>\n<p>To apply, just DM your motivation text to either TxT or ExxPlore. The admins and current moderators will decide over the applications together. There are no formalities to be followed, but here's some inspiration on what you can include in your application:</p>\n<ul class=\"rules\">\n  <li>What are the characteristics of a good moderator?</li>\n  <li>How would you deal with toxic behavior on Paxterya?</li>\n  <li>What is your motivation to become a moderator?</li>\n  <li>How do you deal with conflicts?</li>\n  <li>How should the atmosphere on Paxterya be?</li>\n</ul>\n<p>You can apply until <b>July 31, 23:59 CEST</b>. We'll be happy to hear from you!</p>\n\n<h3>What happens with the old moderators?</h3>\n<p>The old moderators PrimateAfterMath, MrSprouse and swabfu agreed to be promoted to admins. They will be granted more permissions, such as access to the server console, so we as a team can act faster when the server crashes et cetera. The role of TxT and ExxPlore will be renamed from “Admin” to “Owner”.</p>",
  "date": {
    "$date": "2020-07-27T00:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5f2572e307a10800117495a6"
  },
  "id": 23,
  "title": "The New Paxterya Team",
  "author": "ExxPlore",
  "body": "<p>Five days ago, we announced we were searching for new moderators to enlargen our team and prepare for the future of Paxterya. We received applications from 8 Paxteryans, which is more than anticipated. So we thank each and every applicant for their willingness to invest some time into keeping Paxterya a fun and friendly place!<br>\nThe current staff team consulted and agreed on adding four Paxteryans to the team. It was not an easy choice, as all of the applicants are exemplary and valued Paxteryans that we're happy to have in our community. But as eight new moderators would be too many, we agreed to add to our team:</p>\n<ul class=\"rules\">\n<li>Akimoro</li>\n<li>MushrooMax420</li>\n<li>sediment_fellow</li>\n<li>Veikmaster</li>\n</ul>\n<p>\nOnce again, thanks to all applicants and to all the members who make Paxterya what it is!\n</p>",
  "date": {
    "$date": "2020-08-01T00:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "5f834f2588e9de0011cf6cad"
  },
  "id": 24,
  "title": "Halloween Building Competition",
  "author": "TxT",
  "body": "      <p>It's getting cold and dark again in the northern hemisphere as autumn is getting started. I bet you all know what that means: Halloween is right around the corner!</p>\n      <p>To celebrate this yearly festivity, we decided to host a <b>Halloween/Spooktober themed build contest</b>.</p>\n      <br>\n      <p>The event will <b>start on the 17th of october and last for 2 weeks</b> till the 31st.</p>\n      <br>\n      <p>All you need to do to participate is to <b>pick a plot</b> (located at 5400/8500, nether portal at 670/1070) and mark it as yours with a sign.</p>\n      <p>Plots are 25*25 in size, you are allowed to use the entire build height.</p>\n      <p>There is no upper limit in participants, we will just add more plots as necessary</p>\n      <p>You also have to pay a <b>participation fee</b> of at least one diamond block (more is always welcome!). The chest is right at the bridge (coords: 5435/8515). All fees go towards the price pot.</p>\n      <p>Once the time is up the community will vote on which build is the best. The price pot will then be distributed amongst the top rated builders.</p>\n      <p>I hope this covers all important details, if not ask the staff team on discord for clarification.</p>\n      <br>\n      <p>Happy building!</p>",
  "date": {
    "$date": "2020-10-11T00:00:00Z"
  },
  "public": true,
  "__v": 0
},{
  "_id": {
    "$oid": "605203044a062b008d696e34"
  },
  "id": 25,
  "author": "ExxPlore",
  "body": "<p>Hello Paxteryans! As you might know, I've recently built a castle in Creative, but left it empty. Now it's up to you to fill it with life! The main prize is a <b>cinematic video</b> dedicated to your entry!\nThe competition takes place on the Creative server. I prepared a number of empty castles for the participants to fill with life.</p>\n\n<br>\n<div class='article-img'><img src='https://stor.paxterya.com/website/articles/014.webp'><span class=\"subtitle\">Decorate this castle and win!</span></div>\n\n<h3>How do I enter?</h3>\n<ul class='rules'>\n  <li>Let me know you want to participate. I will assign you an empty castle on the Creative server!</li>\n<li>Donate as many diamonds as you want to the prize pool! (Not mandatory, but cool)</li>\n<li>The prize pool chest is at the portal of the Shopping District, you can't miss it!</li>\n<li>You have time to build until April 19 2021, 12PM CET.</li>\n</ul>\n\n<br>\n\n<p>To make all entries comparable, please pay attention to the following guidelines.</p>\n<br>\n\n<h3>What you can do:</h3>\n<ul class='rules'>\n  <li>Modify the walls in order to place your interior</li>\n<li>Add/remove windows</li>\n<li>Place walls freely</li>\n<li>Modify roofs to add windows/balconies/chimneys etc.</li>\n<li>Add details to the courtyard</li>\n<li>Add entries and details to the insides of the towers and walls</li>\n<li>Add basements to the houses</li>\n<li>Change the location of the doors</li>\n</ul>\n\n<h3>What you can't do:</h3>\n<ul class='rules'>\n  <li>Change the footprint of a house</li>\n<li>Add an extra floor to a house (except basements)</li>\n</ul>\n\n<h3>Deadline:  April 19 2021, 12PM CET</h3>\n\n<p>After the deadline, all Paxteryans are invited to rate all entries based on the following criteria, on a scale of 1-10. The people will decide the winner! More infos on this once the deadline has passed.</p>\n<br>\n<h3>Rating Criteria</h3>\n<ul class='rules'>\n  <li>Immersion (does the interior feel like a real place?)</li>\n<li>Practicality (could you use the houses in Survival?)</li>\n<li>Cohesion (do the rooms/houses fit together?)</li>\n<li>Creativity (how much variation is there?)</li>\n<li>Detail</li>\n</ul>\n\n<h3>Rewards</h3>\n<ul class='rules'>\n<li><b>1st place:</b> Cinematic video of your entry on the Paxterya channel (with your name in the title) + 50% of the diamonds in the prize pool</li>\n<li><b>2nd place:</b> 25% of the diamonds in the prize pool + honorable mention in the winner's video</li>\n<li><b>3rd place:</b> 25% of the diamonds in the prize pool + honorable mention in the winner's video</li>\n</ul>\n",
  "date": {
    "$date": "2021-03-20T00:00:00Z"
  },
  "public": true,
  "title": "Interior Building Competition",
  "__v": 0
},{
  "_id": {
    "$oid": "60b79ea7dc1386001109ab79"
  },
  "id": 26,
  "author": "ExxPlore",
  "body": "<p>Hey Paxteryans, we have great news for you! Minecraft 1.17 was announced to release on June 8, and so we have set the launch date of Paxterya Season 5 to <b>Sunday, July 18 2021, 7pm CEST/1pm ET/10am PT</b>. That's exactly 1 year after the launch of Season 4! We made it!\n<br><br>\n<div class='article-img'><img src='https://stor.paxterya.com/website/articles/015.webp'></div>\n\n<p>If July 18 still seems awfully far away for you, you're not alone! But this way, we can make sure that all our required plugins are updated in time, that the map is pre-generated, and that every Paxteryan has had enough time to plan what they want to do next season – because don't forget, it'll be all about districts this time, and thus more cooperation than ever! You can expect more blog posts about this topic, as we will need to elect district leaders and assign territories before July 18.\n<br><br>\nSo as you can see, even though it will still take a few weeks before Season 5 finally starts, there's already plenty to do, and we hope to see you participate in the discussions and the planning!</p>\n<br>\n<h3>Vote for the Seed!</h3>\n<br>\n<p>Today, we can already take the first exciting step towards Season 5: choosing the map we will play on! We have pre-chosen 5 seeds that all fulfill the following criteria:\n<ul class='rules'>\n  <li>no spawn in a desert, jungle or swamp</li>\n<li>a desert and gravelly mountains within a 1k radius from spawn</li>\n<li>at least 2 villages within a 1k radius from spawn</li>\n<li>no ocean that takes away too much space from the map</li>\n</ul>\n\n\n<p><b>Now it's up to you to vote!</b><br> Go to the <b>#s5-seed-vote</b> channel on our Discord, look through the images we provided for the different seeds and:\n<ul class='rules'>\n<li>Vote for your favorite seed(s) with the \"checkmark” reaction</li>\n<li>Vote for your preferred map size(s) (“1” for 1k², “2” for 2k², “3” for 3k²)</li>\n<li>Please <b>do vote on the map size on every seed</b>.</li>\n</ul>\n\n<p>On the maps of the seeds, each square represents 512 blocks, so that:</p>\n\n<ul class='rules'>\n<li>2x2 squares = 1024x1024 blocks</li>\n<li>4x4 squares: 2048x2048 blocks</li>\n<li>6x6 squares: 3072x3072 blocks</li>\n</ul>\n<p>\nThis vote will be closed after 7 days. We will then announce the winner along with the chosen map size. Then, we can go on to planning which district should go where. <br>Note that the map can be expanded later on to get access to a stronghold and other biomes, but we'll keep it on the voted size for at least a few weeks.</p>\n",
  "date": {
    "$date": "2021-06-03T00:00:00Z"
  },
  "public": true,
  "title": "Paxterya Season 5 starts on July 18!",
  "__v": 0
},{
  "_id": {
    "$oid": "60c1ccfbb2687c0011868ea1"
  },
  "id": 27,
  "author": "ExxPlore",
  "body": "<p>Minecraft 1.17 is now finally released, and the start of Season 5 comes ever closer! Over the last week, all Paxteryans had the chance to choose between five seeds, and the winner now stands!</p>\n<br>\n<div class='article-img'><img src='https://stor.paxterya.com/website/articles/s5-seed-winner.webp'><span class='subtitle'>The map we will play on!</span></div>\n\n<p>With 29 votes, the seed for Season 5 shall be Seed 5! How fitting! Also, a majority of you voted for the largest map size available, so the Season 5 map will be 3000x3000 blocks big!<br>Take a look at Seed 5 again: <a href=\"https://imgur.com/a/HdOGDjl\">https://imgur.com/a/HdOGDjl</a><br>\nOver the weekend, I will take a lot more screenshots with the coordinates on them, so you can start choosing a location.</p>\n<br>\n<h3>Introducing: Districts</h3>\n<br>\n<p>Remember the Districts we talked about? They're now there, along with some more concrete plans! The five Districts we will have in Season 5 are: the <b>Medieval District</b>, the <b>Fantasy District</b>, the <b>Steampunk District</b>, the <b>Cyberpunk District</b> and the <b>Underwater District</b>. They will have cooler-sounding names as well, but these descriptive names will be helpful to understand the differences.</p>\n<br>\n<h3>What are Districts?</h3>\n<p style=\"margin-left: 20px\">Districts fought for power on this small map where resources are valuable, and so the entire map is now split between the five. Each new player must choose one of the five districts as their home District. Each District is united under a name and a common theme, but its citizens are free. The citizens of a District must, under the leadership of their chosen District Leader, work together to build an epic and theme-fitting District Center to display the power and wealth of their home District. Outside of the District Center, they can set up their base autonomously.</p><br>\n<p style=\"margin-left: 20px\">The District Center is where the District is most active, where they build the most things and where the District Leader holds power. It will be marked with a darker color on Dynmap.</p><br>\n<p style=\"margin-left: 20px\">The Outer Zone of a District is the entire area between the District Center and the other Districts. It will be marked with a lighter color on Dynmap.</p><br>\n<p style=\"margin-left: 20px\">The goal for Districts is to be more than Towns in the last two seasons. As the entire map (3000x3000 blocks) will be divided between the five Districts, everyone has to be affiliated to a District of their choice.</p><br>\n\n<h3>How do I join a District?</h3>\n<p style=\"margin-left: 20px\">To build in the District Center (darker color on Dynmap), you must get in touch with the District Leader.</p><br>\n<p style=\"margin-left: 20px\">To build in the Outer Zone of a District (lighter color on Dynmap), you don't have to ask anyone. You don't have to follow the theme of the District Center, but please do choose a District that is not in total contrast with your desired build style (e.g. no medieval base in the Cyberpunk District).<br>Also, <b>please ask a staff member to mark your base on Dynmap</b>, so people can easily find and visit you! As always, if there are other buildings nearby your desired base location, please check with their owners if you can build there.</p><br>\n\n<h3>Can I choose multiple Districts?</h3>\n<p style=\"margin-left: 20px\">No. You have to choose one home District that you're officially affiliated to. But you can still build elsewhere too.</p><br>\n\n<h3>Can I change my District?</h3>\n<p style=\"margin-left: 20px\">No. You choose one District at the start of the season that will stay your “main address”.</p><br>\n\n<h3>Can I build in multiple Districts?</h3>\n<p style=\"margin-left: 20px\">Yes. You can even build in all five District Centers, if all Leaders let you in.</p><br>\n\n<h3>I have an idea to build XY, can I make it a District?</h3>\n<p style=\"margin-left: 20px\">No. We are set on the five Districts throughout the season, but you can of course realize your project in the Outer Zone of any District.</p><br>\n\n<h3>What are District Leaders?</h3>\n<p style=\"margin-left: 20px\">District Leaders keep their District running by recruiting players, planning community projects, outlining what the District should look like. See them like Chief Creative Officers. They have to have a vision for their District.</p><br>\n<p style=\"margin-left: 20px\">District Leaders will be elected before the start of Season 5. To candidate for one of the Districts, go to our #s5-planning Discord channel.</p><br>\n\n<h3>Where do we go from here?</h3>\n<p>Now is the time of planning. With the seed now chosen, you can now start negotiating for territory, as we have to split the entire map between the five Districts. <b>Go to #s5-planning on Discord</b> to come to an understanding with the other Districts, to request screenshots of specific areas on the map et cetera!</p><br>\n\n<p>Finally, another blog post will come to present the individual Districts in more detail and to elect District Leaders! Busy times!</p>",
  "date": {
    "$date": "2021-06-10T00:00:00Z"
  },
  "public": true,
  "title": "Season 5 Preparation: Seed Decision & Districts",
  "__v": 0
},{
  "_id": {
    "$oid": "60ccb00516b7520011d4f35d"
  },
  "id": 28,
  "author": "ExxPlore",
  "body": "<p>Minecraft is now over 12 years old. The blocky sandbox game has risen from a one-man project by a then unknown developer to the single best-selling video game in history, owned by one of the largest tech companies in the world. It has influenced an entire generation of gamers, practically everybody has played it at some point in their life, and the streak of success seems to continue forever. How did it get there? How does Mojang keep Minecraft alive? And when will the era of Minecraft come to an end?</p><br>\n\n<iframe width=\"100%\" height=\"300\" src=\"https://www.youtube-nocookie.com/embed/Au_RDBi3KM0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><br>\n\n<br>\n<h3>The beginnings of Minecraft</h3>\n<p>In May 2009, nobody has yet heard of Minecraft. That's because the Swedish game developer Markus Persson, better known as Notch, first named his project &ldquo;Cave Game&rdquo;. Shortly after, he renamed it to &ldquo;Minecraft: The Order of the Stone&rdquo;, then to just &ldquo;Minecraft&rdquo;. He probably didn't guess he was working on what was soon to become a phenomenal hit. Fast forward by 5 years (November 2014), and he sells his game to Microsoft for 2.5 billion dollars. He has since largely disappeared from public interest, but Minecraft has only kept growing.<br>\nOf course, Minecraft's long lasting success is partly due to it being a sandbox game. It gives you no instructions on where to go and what to do, and so there's no clear end to the gameplay. The so-called &ldquo;End&rdquo; in-game is really just a new world that opens even more possibilities, so the gameplay experience in Minecraft is what the player makes of it. Everyone can follow their passions and so entire subcultures developed inside of Minecraft. There's people interested in building, redstone, PVP, modding, texture pack and skin creation... You know the drill. Compared to some other popular games, Minecraft offers the most individualized gameplay, and the highest replay value. You can always start a new world and create new things, as long as you have fresh ideas. So the very concept of Minecraft is part of its long-term success, binding players to the game for more than 12 years now.</p>\n<br>\n<h3>The update philosophy</h3>\n<p>Another important factor in the continuous success of Minecraft is the way Mojang updates their game. When you look at the list of the best-selling video games in the world, most of them were released to the public at one point and then never have been changed in any major way. Minecraft is different, and that's part of why it's on the top of that list.<br>\nIn the last 10 years, Mojang has released 18 major updates, on average a new update with new, game-changing features every 7 months. This constant addition of new content surely helps to spark the players' creativity. And that creativity is what Minecraft relies on to keep players engaged.<br>\nEngagement is a key word in Mojang's philosophy. Before any update, they hear out the community &ndash; the best example being the votes on new features during Minecon. In 2019, players could vote which of three biomes should be redesigned, and a year later they could choose which new mob was to be added to the game.<br>\nNot only does this prevent any big backlash about unpopular changes, because people had a choice, but it makes sure there are no unpopular changes in the first place. This is of course highly subjective, but generally, the new features in all the major updates have been received relatively well by the player base. That's because Mojang succeeds to keep everything coherent &ndash; or &ldquo;minecraft-y&rdquo;. The new features don't seem out of place, they fit into the existing environment. So how do they achieve that? Do the Mojang devs just have a great intuition about what is too far away from the Minecraft feeling? Well, probably also that, but what really matters here is the way Mojang constantly asks for community feedback. There are lots of tweets you can find where normal players directly influenced the development process, because many Minecraft developers are very active on Twitter and engage with the community.<br>\nSo after 12 years of constant changes to the game, the only instance of widespread criticism of a new update is when Mojang changed the PVP system in 2016. Not a bad record.<br>\nAnother great example of Mojang's dedication to keep the game &ldquo;minecraft-y&rdquo; is how they handled the new &ldquo;archaeology&rdquo; feature. After it had been announced to be released in 1.17, then 1.18, it has been postponed to an undisclosed date because Mojang felt it didn't yet fit in the Vanilla Minecraft world.</p>\n<br>\n<h3>Minecraft Multiplayer: Games In The Game</h3>\n<p>Arguably the most important Minecraft update was the multiplayer update in August 2010. It was part of an early alpha version, which goes to show that multiplayer is at the very core of Minecraft. Now while it was originally intended for playing Survival Minecraft with your friends instead of alone, this new feature was the stepping stone to much more than that. Thanks to multiplayer, entire games have been made inside of Minecraft, resulting in hugely successful server networks offering dozens of game modes to players. So you could argue that by buying Minecraft, you don't just buy one, but potentially hundreds of games. In this regard, Mojang hugely profits from its player base's creativity. With Minecraft, they give the creative outlet to players, developers and modders to come up with new things themselves, contributing to Minecraft's overall popularity and success.</p>\n<br>\n<h3>Communities and subcultures</h3>\n<p>With all the creative tools Minecraft has to offer, thousands of communities have evolved around the game. There are countless Minecraft servers, Discord servers, forums, subreddits and so on about different aspects of Minecraft. People form small and large groups around their shared passion, find friends, inspire each other, and with joined forces, they often create stunning work. If you take it to the extreme, you could even compare Minecraft to social media. It arguably connects people in a more profound way than Facebook ever has.</p>\n<br>\n<p>So what does Mojang do to promote this? Today, apart from making the game, they also offer basic server hosting for groups of friends to play together. In 2013, Mojang introduced Minecraft Realms which enables you to very easily rent a server directly from the in-game menu. Where you had to consult an external service provider before, Mojang now got you covered. Definitely part of a bigger strategy.</p>\n<br>\n<h3>Let's Play Minecraft</h3>\n<p>And then there's YouTube. Minecraft is huge on YouTube. In the early days of Let's Play videos, there was still uncertainty about copyright issues, whether players were actually allowed to upload content entirely recorded in-game. But eventually the consensus was that game studios profit from these free advertisements of their games. Minecraft soon became the biggest Let's Play category on YouTube, as Mojang actively encouraged players to create Minecraft content. During Minecon 2013 for instance, there were panels about different aspects of content creation, teaching players how to build an audience and essentially generate more public interest for Minecraft. A win-win situation.</p>\n<br>\n<h3>More Diversity: Reaching New Audiences</h3>\n<p>Today, Minecraft is everywhere. The game has become a brand, there's Minecraft t-shirts, mugs, keychains, books, lamps, phone cases, pins, and of course the spin-off games Minecraft Dungeons, Minecraft Earth, Minecraft Story Mode and there's even a Minecraft Education Edition.<br>\nAnd, more importantly, the original Minecraft game has been renamed to &ldquo;Minecraft Java Edition&rdquo;, and the original logo now belongs to the cross-platform Bedrock Edition. The Bedrock edition was Mojang's attempt to acquire new players with improved performance on the PC, but also enabling users of other devices to play Minecraft on phones and tablets, on the XBOX, PlayStation, Nintendo Switch and even in VR. While the Bedrock Edition has long lacked popularity among many veteran Java Edition players, Mojang's strategy fully worked out. The monthly sales of Bedrock edition have long surpassed those of the Java Edition. Part of its financial success is the marketplace where you can buy skins, maps, texture packs, or, well: things you can get for free on Java Edition. One of the reasons many Java players dislike the Bedrock edition.<br>\nStill, Mojang found a way to keep making money off of a game that most people already bought &ndash; and in the end, all Minecraft players profit from that, as the development continues.</p>\n<br>\n<h3>The Future: When Will Minecraft End?</h3>\n<p>Over the past years, Mojang constantly added more blocks, items and features to their game &ndash; making the gameplay more varied, more interesting, but also &ndash; more complex. Today, Minecraft has 3 dimensions, 75 mobs, 79 biomes and a staggering 726 different items. That's twice the amount of items there were in 2011. Can this trend continue forever? Inventory management has become a real issue for many players, and Mojang has not yet come up with a viable solution.<br>\nWhat's for sure is that the gameplay can still become much more complex and still be playable. Dozens of very popular modpacks out there prove that. The decision from what point on the number of features becomes too overwhelming for the average person and especially new players is ultimately up to Mojang. But given their history of hearing the community's feedback, I'm sure they will make the right decision. Today, there is still no end in sight for the development of Minecraft, and whether a final Minecraft version will ever be released is up for the future to show us. Until then, let's look forward to the biggest Minecraft update in a long time, 1.18. And celebrate this game that makes you keep coming back like no other.</p>",
  "date": {
    "$date": "2021-06-25T00:00:00Z"
  },
  "public": true,
  "title": "How Mojang Keeps Minecraft Alive",
  "__v": 0
},{
  "_id": {
    "$oid": "60ccba0c16b7520011d4f35e"
  },
  "id": 29,
  "author": "ExxPlore",
  "body": "<p>Welcome back to another Season 5 Preparation blog post! The launch of Season 5 is now just a few weeks away, and the upcoming map is pretty much planned out! The five Districts have been allocated their territories, and the ideas start sprawling!</p>\n\n<p>To help you choose your future (main) home, the current District Leader candidates have described their plans.</p><br>\n\n<h3>The Five Districts</h3><br>\n\n<img style='margin-bottom:5px;' width='300' src='https://stor.paxterya.com/website/articles/medieval-district.webp'>\n<p>\nHidden deep inside a forest, surrounded by a wall, our District is keen on keeping its citizens safe. Outside, danger lurks. Monsters everywhere, misled outlaws, deceiving Districts. Inside, a vibrant community is flourishing. Homes in a calming, rustic style, houses wall to wall, narrow streets and busy marketplaces, our District promises safety and comfort. While our lifestyle is modest, we do however not renounce on the advantages of modern technology, we too see the benefits of redstone farms, and we too see the importance of monumental builds to keep our minds busy and our hearts at peace.\n</p>\n\n<br><br>\n<img style='margin-bottom:5px;' width='300' src='https://stor.paxterya.com/website/articles/fantasy-district.webp'>\n<p>\nAn entire nation terraformed to complete absurdity. Within it, towns led by independent communities. The nation is irradiated by the magic of an ancient gigantic dragon that died on the land, its skeleton still standing as a gargantuan monument. Through the decades, the land has fused with the bones of the ancient beast, thoroughly connecting itself to the magical source of the dragon: a gigantic heart. To this day, it is still alive inside of the monolithic ribcage that spans across the entire continent. sometimes, when the wind is right, you can still hear it beating.\n</p>\n\n<br><br>\n<img style='margin-bottom:5px;' width='300' src='https://stor.paxterya.com/website/articles/steampunk-district.webp'>\n<p>\nFinally entering the 17th century, the Steampunk District has just started growing to power due to the Industrial Revolution. The creation of new and crazy machines and the discovery of physics that no one could have imagined has caused builders, redstone technicians and people looking for a new life to come together in this new land of possibilities. A land filled with wonders and revelations around every corner. The Steampunk District is excited to introduce all these new people to a land of towering, physics-defying buildings filled with crazy machines making everyday life a new adventure…\nWelcome to Aggregate!\n</p>\n\n<br><br>\n<img style='margin-bottom:5px;' width='300' src='https://stor.paxterya.com/website/articles/cyberpunk-district.webp'>\n<p>\nWelcome to the future. It’s not what you expected. The Cyberpunk district is a densely packed, barren cityscape using exclusively gray tones and neon pink and blue lights. The premise of Cyberpunk is a lawless society that is dominated by technology and computers. It is what society would be if we had to pack as many people as we could into cities and they were entirely run not by humans, but by the decisions of Artificial Intelligence. All greenery? Gone. All laws? Gone. Crime, violence, pollution? You bet. Citizens of Dysterya will have the challenge of adding to a growing city and densely packing it with buildings to make it the most inspiring city-type district on the server while remaining challenged to also keep within the difficult theme of Cyberpunk. Come build the future.\n</p>\n\n<br><br>\n<img style='margin-bottom:5px;' width='300' src='https://stor.paxterya.com/website/articles/underwater-district.webp'>\n<p>\nThis place is to admire the fish, while you sit back in your glass dome house (or whatever you want to build) and relax. We are here to have fun not just on land but also in the water. Our goal as a community is to bring the town of Paxlantis out of the water and show the beauty of an underwater city. We are welcoming to anyone who would like to be a part of our community.\n</p>\n<br>\n<h3>The District Leaders</h3>\n<p>Normally we would have voted for the District Leaders. But as there are no competing candidates, there is no reason to. So, the District Leaders in Season 5 shall be:</p>\n<ul class='rules'>\n  <li>Medieval District: ExxPlore</li>\n  <li>Fantasy District: _maaay_</li>\n  <li>Steampunk District: Raderth & Billybones62</li>\n  <li>Cyberpunk District: Lucky74 & Pepi07</li>\n  <li>Underwater District: _Nebou_</li>\n</ul>\n\n<br>\n<h3>Join your District</h3>\n<p>Now that you know all the Districts, it is time to choose! Go to #bot-spam to assign yourself one or more District role(s). <b>Note: The first District you join will be documented as your home District</b>. You can still build in other Districts, but your starter base should be in your home District.<br><br>To join a District, use one of these commands:</p>\n<ul class='rules'>\n  <li>/role add medieval</li>\n  <li>/role add fantasy</li>\n  <li>/role add steampunk</li>\n  <li>/role add cyberpunk</li>\n  <li>/role add underwater</li>\n</ul>\n<p>This will grant you access to the corresponding District's Discord channel. Happy planning!</p>",
  "date": {
    "$date": "2021-06-22T00:00:00Z"
  },
  "public": true,
  "title": "Season 5 Preparation: Choose Your District!",
  "__v": 0
},{
  "_id": {
    "$oid": "62377bbdafb2b00012df8caf"
  },
  "id": 30,
  "author": "TxT",
  "body": "<p>We just ran a poll for the first time in our almost 5 year history! We mainly wanted to know a couple of things to plan the next season. Today we are just looking at the results, actual actions, details and dates will follow soon and will be posted on our <a href=\"https://discord.gg/mAjZCTG\">Discord server</a>.</p>\n<br>\n<p>The most important questions comes first:</p><img style=\"width: 75%;\" src='https://stor.paxterya.com/website/articles/2022-03-20-poll/1.webp'>\n<p>Now this is an almost perfect split between players wanting to start a new season <b>NOW</b> and as soon as 1.19 releases. Seeing that there aren't really any active players in the current season it's probably best to start a new Season as soon as we can and then have a poll on what we should do once 1.19 drops sometime later this year.</p>\n<br>\n<p>The second question was \"What can staff do to increase your motivation to play?\" and the answers we got where plenty! The answer we probably got most is that more community events would help with motivation. I also feel like we have been lacking there a bit. If you any ideas about cool events, then please let us know on Discord!</p>\n<br>\n<p>Question number three was about the terrain generation.</p><img style=\"width: 75%;\" src='https://stor.paxterya.com/website/articles/2022-03-20-poll/3.webp'><p>Well, seems like we should go back to vanilla generation, with only 16.7% of players wanting custom terralith terrain again. While it does look amazing, it certainly makes playing a bit more difficult, I think.</p>\n<br>\n<p>In question four, we wanted to know your preferences for world size.</p><img style=\"width: 75%;\" src='https://stor.paxterya.com/website/articles/2022-03-20-poll/4.webp'><p>In the current season we have a fairly large map at 60km * 60km and while around a fifth of players seem to like a huge map we have over half of players wishing for 30km * 30km or smaller. Well technically also almost 3/4 of players want 30km * 30km or more. I think we will probably settle at exactly that size as 1/3 seem to prefer it and because going larger really gets insane on the data storage needs. Keep in mind that we also have to back all that stuff up! (Our current world size is ~200GB)</p>\n<br>\n<p>Question five and six where about towns.</p><img style=\"width: 75%;\" src='https://stor.paxterya.com/website/articles/2022-03-20-poll/5.webp'><p>In summary, its seems like the vast majority of players are pretty happy with our current town system. However some people mentioned that towns can create quite a bit of drama, which has certainly been true this season. It was also suggested that towns should be more about building style and less about an area controlled by a single mayor. </p>\n<br>\n<p>In question seven we just wanted to gather sentiment about the shopping district.</p><img style=\"width: 75%;\" src='https://stor.paxterya.com/website/articles/2022-03-20-poll/7.webp'><p>Well, 2/3 of players seem to want one again with 1/5 not really caring. One way to improve the shopping district experience is probably to have less regulation again, but we will need to discuss the details over in our Discord server.</p>\n<br>\n<p>One way to change up the playing experience would have been some good old lore. This was covered in questions eight and nine:</p><img style=\"width: 75%;\" src='https://stor.paxterya.com/website/articles/2022-03-20-poll/8.webp'><p>Well, most players seem to either not care or be straight up against it. I think a lore that everyone follows only works if most players actually want it. A few ideas for lore have been submitted, but to be honest none have been really exciting to me. In conclusion as one answer puts it: \"no\".</p>\n<br>\n<p>In question ten we wanted to know if there any other games we should play together. Most games got only mentioned once, with the two exceptions being GTA 5 and Factorio. I would certainly love to play some Factorio again soon ;) There also was the mention of <a href=\"https://tenor.com/view/19dollar-fortnite-card-among-us-amogus-sus-red-among-sus-gif-20549014\">Among us</a>...</p>\n<br>\n<p>We used to have a regular game night, but that has kinda died down since season 6 started. In question eleven we wanted to know if it should return.</p><img style=\"width: 75%;\" src='https://stor.paxterya.com/website/articles/2022-03-20-poll/11.webp'><p>To make it short: YES! Im not sure when we are going to host the first game night again, but it surely won't take long :)</p>\n<br>\n<p>In question twelve we wanted to know if you have any ideas for new features for our website and Discord bot. Most people seem to be pretty happy with it, although there have been two mentions of adding music listening capabilities (RIP Groovy & Rythm). Well maybe that's something I will get to one day.</p>\n<br>\n<p>Last, but not least, there was question thirteen. In there we wanted to know about anything else we can do to improve Paxterya. There has been lots of valuable feedback we will try to implement!</p>\n<br>\n<p>Well that's already it. Thanks to all the 42 participants! We will now try to draft the plans for season 7, so keep your eyes peeled for any announcements on our Discord server!</p>",
  "date": {
    "$date": "2022-03-20T00:00:00Z"
  },
  "public": true,
  "title": "The grand Paxterya Survey Spring 2022: The results!",
  "__v": 0
},{
  "_id": {
    "$oid": "62dbee895ebb560012640901"
  },
  "id": 31,
  "author": "ExxPlore",
  "body": "<p>As you might have noticed, something has changed over the past months and seasons.\nMany of us don't play as much Minecraft as before anymore. Many of us don't at all. Many of us have gone on to do different things, set different priorities in life.\n<br><br>\nFor many of us, the spark of Minecraft is gone - for the moment. That's why TxT and I have made the difficult decision to close down the Minecraft server. Not now, not instantly - but on <b>September 23rd</b> of this year. That is exactly 3 years after the last launch of the Paxterya project.<br><br></p>\n<h3>The History of Paxterya</h3>\n<p>\nOn September 23, 2019, we started Paxterya Beta, now called Season 2, for simplicity's sake. The past 3 years have been great (except the whole world crises stuff - strictly speaking about Minecraft here).\n<br><br>\nIn Season 2, we were so few Paxteryans. Among the rare members before the third Season in December 2019 were Veik, Sprouse and Aki. All of which are on the staff team today and have put so much time and passion into the maintenance of this community. Thanks to you and the other staff May, Lola, MrCarMan, swab, shrum and Flamme, this whole undertaking was even possible. TxT and I wouldn't have managed to keep Paxterya a friendly place without you.\n<br><br>\nHave you noticed I just spoke about Season 2 being the start in 2019? What about Season 1? That one started on June 4, 2017 and was shut down a few months later. It took a full two years before TxT and I sat in the school cafeteria making plans for a Minecraft server again. So you never know what might happen, like it always is in life.\n<br><br></p>\n\n<h3>An Outlook on the Future</h3>\n<p>The truth is, for most of you, this announcement won’t change a lot. If you don’t currently play Minecraft, Paxterya will stay exactly the way it is now for you. We absolutely will keep our Discord server around till the end of time. Because this community that has originally grown around Minecraft is still thriving – just discussing other topics. When our Minecraft server shuts down, you might see some new arrangements of the channels, but the people will still be the same. Let's stay in touch and meet for game nights occasionally!\n<br><br>\nFor those of you who are still very much playing Minecraft and enjoying every second of it: We’re sorry to leave you hanging like this. But we’re sure you will find another server that’s more active, more motivated, and more fun to play on. You do deserve a blocky environment where everyone involved is passionately playing Minecraft, including the owners. We’d however be delighted if you sticked around to still be part of this non-Minecraft-playing community!\n<br><br>\nIf you’ll be playing Minecraft on another server – or even if you’re going to make your own – we encourage you to share where you’re going in <b>#smp-radar</b>. You don’t have to do this, but it would be an easy way for you to form groups and still play together on other servers. You can advertise other SMPs in that channel and discuss your experiences there. Just please keep it personal and don't spam ad messages there.\n<br><br></p>\n\n<h3>Wrapping Up</h3>\n<p>\nThanks to each and every one of you to have been part of this Minecraft journey. We have made amazing memories with all of you, forever conserved on our YouTube channel.\n<br><br>\nDon't be sad because it's over. Be happy because it happened!</p>",
  "date": {
    "$date": "2022-07-23T00:00:00Z"
  },
  "public": true,
  "title": "Paxterya's Minecraft Server Will Close on Sep 23. Here's Why.",
  "__v": 0
}]